## Production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 22 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                NAME                                |
|----------|--------------------------------------------------------------------|
| update   | `aws_eks_addon.coredns`                                            |
|          | `aws_eks_addon.ebs_driver`                                         |
|          | `aws_eks_addon.kube_proxy`                                         |
|          | `aws_eks_addon.vpc_cni`                                            |
|          | `aws_eks_cluster.notification-canada-ca-eks-cluster`               |
|          | `aws_eks_node_group.notification-canada-ca-eks-node-group-k8s`     |
|          | `aws_iam_openid_connect_provider.notification-canada-ca`           |
|          | `aws_iam_role.notification-service-account-role`                   |
|          | `aws_iam_role.secrets_csi_blazer`                                  |
|          | `aws_iam_role.secrets_csi_github`                                  |
|          | `aws_iam_role.secrets_csi_nginx`                                   |
|          | `aws_secretsmanager_secret.admin_target_group_arn`                 |
|          | `aws_secretsmanager_secret.api_target_group_arn`                   |
|          | `aws_secretsmanager_secret.aws_region`                             |
|          | `aws_secretsmanager_secret.base_domain`                            |
|          | `aws_secretsmanager_secret.document_download_api_target_group_arn` |
|          | `aws_secretsmanager_secret.documentation_target_group_arn`         |
|          | `aws_secretsmanager_secret.nginx_target_group_arn`                 |
|          | `aws_secretsmanager_secret.pr_bot_app_id`                          |
|          | `aws_secretsmanager_secret.pr_bot_installation_id`                 |
|          | `aws_secretsmanager_secret.pr_bot_private_key`                     |
|          | `module.iam_assumable_role_karpenter.aws_iam_role.this[0]`         |
| recreate | `aws_secretsmanager_secret_version.eks_karpenter_ami_id`           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.notify_cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "notify_cluster" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "notification-canada-ca-production-eks-cluster"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_iam_policy_document.eks-assume-role-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "eks-assume-role-policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:notification-canada-ca:notification-service-account",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.secrets_csi_assume_role_policy_blazer will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "secrets_csi_assume_role_policy_blazer" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:tools:blazer",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.secrets_csi_assume_role_policy_github will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "secrets_csi_assume_role_policy_github" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:github-arc-controller:github-arc-gha-rs-controller",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.secrets_csi_assume_role_policy_nginx will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "secrets_csi_assume_role_policy_nginx" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:nginx:ingress-nginx-ingress",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_security_group.eks-securitygroup-rds will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_security_group" "eks-securitygroup-rds" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = "sg-09e3175f46bc85607"
      + name        = (known after apply)
      + tags        = (known after apply)
      + vpc_id      = (known after apply)
    }

  # data.tls_certificate.notification-canada-ca will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "notification-canada-ca" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
    }

  # aws_cloudwatch_log_subscription_filter.admin_api_request has moved to aws_cloudwatch_log_subscription_filter.admin_api_request[0]
    resource "aws_cloudwatch_log_subscription_filter" "admin_api_request" {
        id              = "cwlsf-2337749455"
        name            = "Admin API request"
        # (4 unchanged attributes hidden)
    }

  # aws_eks_addon.coredns will be updated in-place
  ~ resource "aws_eks_addon" "coredns" {
      ~ addon_version               = "v1.11.1-eksbuild.6" -> "v1.11.1-eksbuild.9"
        id                          = "notification-canada-ca-production-eks-cluster:coredns"
        tags                        = {}
        # (9 unchanged attributes hidden)
    }

  # aws_eks_addon.ebs_driver will be updated in-place
  ~ resource "aws_eks_addon" "ebs_driver" {
      ~ addon_version               = "v1.27.0-eksbuild.1" -> "v1.31.0-eksbuild.1"
        id                          = "notification-canada-ca-production-eks-cluster:aws-ebs-csi-driver"
        tags                        = {}
        # (8 unchanged attributes hidden)
    }

  # aws_eks_addon.kube_proxy will be updated in-place
  ~ resource "aws_eks_addon" "kube_proxy" {
      ~ addon_version               = "v1.29.0-eksbuild.3" -> "v1.30.0-eksbuild.3"
        id                          = "notification-canada-ca-production-eks-cluster:kube-proxy"
        tags                        = {}
        # (8 unchanged attributes hidden)
    }

  # aws_eks_addon.vpc_cni will be updated in-place
  ~ resource "aws_eks_addon" "vpc_cni" {
      ~ addon_version               = "v1.16.2-eksbuild.1" -> "v1.18.1-eksbuild.3"
        id                          = "notification-canada-ca-production-eks-cluster:vpc-cni"
        tags                        = {}
        # (8 unchanged attributes hidden)
    }

  # aws_eks_cluster.notification-canada-ca-eks-cluster will be updated in-place
  ~ resource "aws_eks_cluster" "notification-canada-ca-eks-cluster" {
        id                        = "notification-canada-ca-production-eks-cluster"
        name                      = "notification-canada-ca-production-eks-cluster"
        tags                      = {
            "CostCenter" = "notification-canada-ca-production"
            "Name"       = "notification-canada-ca"
        }
      ~ version                   = "1.29" -> "1.30"
        # (10 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
        id                   = "notification-canada-ca-production-eks-cluster:notification-canada-ca-production-eks-primary-node-group-k8s"
      ~ release_version      = "1.29.3-20240506" -> "1.30.0-20240522"
        tags                 = {
            "CostCenter"             = "notification-canada-ca-production"
            "Name"                   = "notification-canada-ca"
            "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_iam_openid_connect_provider.notification-canada-ca will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "notification-canada-ca" {
        id              = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
        tags            = {}
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_iam_role.notification-service-account-role will be updated in-place
  ~ resource "aws_iam_role" "notification-service-account-role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:notification-canada-ca:notification-service-account"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "notification-service-account-role"
        name                  = "notification-service-account-role"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.secrets_csi_blazer will be updated in-place
  ~ resource "aws_iam_role" "secrets_csi_blazer" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:tools:blazer"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "secrets-csi-role-blazer"
        name                  = "secrets-csi-role-blazer"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_iam_role.secrets_csi_github will be updated in-place
  ~ resource "aws_iam_role" "secrets_csi_github" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:github-arc-controller:github-arc-gha-rs-controller"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "secrets-csi-role-github"
        name                  = "secrets-csi-role-github"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_iam_role.secrets_csi_nginx will be updated in-place
  ~ resource "aws_iam_role" "secrets_csi_nginx" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:nginx:ingress-nginx-ingress"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "secrets-csi-role-nginx"
        name                  = "secrets-csi-role-nginx"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.admin_target_group_arn will be updated in-place
  ~ resource "aws_secretsmanager_secret" "admin_target_group_arn" {
        id                             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:ADMIN_TARGET_GROUP_ARN-XRc1MI"
        name                           = "ADMIN_TARGET_GROUP_ARN"
      ~ recovery_window_in_days        = 30 -> 0
        tags                           = {}
        # (3 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.api_target_group_arn will be updated in-place
  ~ resource "aws_secretsmanager_secret" "api_target_group_arn" {
        id                             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:API_TARGET_GROUP_ARN-LRgOfH"
        name                           = "API_TARGET_GROUP_ARN"
      ~ recovery_window_in_days        = 30 -> 0
        tags                           = {}
        # (3 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.aws_region will be updated in-place
  ~ resource "aws_secretsmanager_secret" "aws_region" {
        id                             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:AWS_REGION-CkuPd5"
        name                           = "AWS_REGION"
      ~ recovery_window_in_days        = 30 -> 0
        tags                           = {}
        # (3 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.base_domain will be updated in-place
  ~ resource "aws_secretsmanager_secret" "base_domain" {
        id                             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:BASE_DOMAIN-4Z4ZaU"
        name                           = "BASE_DOMAIN"
      ~ recovery_window_in_days        = 30 -> 0
        tags                           = {}
        # (3 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.document_download_api_target_group_arn will be updated in-place
  ~ resource "aws_secretsmanager_secret" "document_download_api_target_group_arn" {
        id                             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:DOCUMENT_DOWNLOAD_API_TARGET_GROUP_ARN-kP6tSG"
        name                           = "DOCUMENT_DOWNLOAD_API_TARGET_GROUP_ARN"
      ~ recovery_window_in_days        = 30 -> 0
        tags                           = {}
        # (3 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.documentation_target_group_arn will be updated in-place
  ~ resource "aws_secretsmanager_secret" "documentation_target_group_arn" {
        id                             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:DOCUMENTATION_TARGET_GROUP_ARN-HNZXZH"
        name                           = "DOCUMENTATION_TARGET_GROUP_ARN"
      ~ recovery_window_in_days        = 30 -> 0
        tags                           = {}
        # (3 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.nginx_target_group_arn will be updated in-place
  ~ resource "aws_secretsmanager_secret" "nginx_target_group_arn" {
        id                             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:NGINX_TARGET_GROUP_ARN-tMs1Gx"
        name                           = "NGINX_TARGET_GROUP_ARN"
      ~ recovery_window_in_days        = 30 -> 0
        tags                           = {}
        # (3 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.pr_bot_app_id will be updated in-place
  ~ resource "aws_secretsmanager_secret" "pr_bot_app_id" {
        id                             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:PR_BOT_APP_ID-EHn56m"
        name                           = "PR_BOT_APP_ID"
      ~ recovery_window_in_days        = 30 -> 0
        tags                           = {}
        # (3 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.pr_bot_installation_id will be updated in-place
  ~ resource "aws_secretsmanager_secret" "pr_bot_installation_id" {
        id                             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:PR_BOT_INSTALLATION_ID-lLMugo"
        name                           = "PR_BOT_INSTALLATION_ID"
      ~ recovery_window_in_days        = 30 -> 0
        tags                           = {}
        # (3 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.pr_bot_private_key will be updated in-place
  ~ resource "aws_secretsmanager_secret" "pr_bot_private_key" {
        id                             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:PR_BOT_PRIVATE_KEY-IJGWmo"
        name                           = "PR_BOT_PRIVATE_KEY"
      ~ recovery_window_in_days        = 30 -> 0
        tags                           = {}
        # (3 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n|terraform-20240605134842389200000002" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20240605134842389200000002" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.iam_assumable_role_karpenter.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc" {
      + id   = (known after apply)
      + json = (known after apply)
    }

  # module.iam_assumable_role_karpenter.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:karpenter:karpenter"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "karpenter-controller-eks"
        name                  = "karpenter-controller-eks"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 22 to change, 1 to destroy.

Changes to Outputs:
  ~ eks_cluster_endpoint                      = "https://BB1100A5BF4708019EB3830B49BF6B60.sk1.ca-central-1.eks.amazonaws.com" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main -...
```

</details>
